[
  {
    "id": "meet-labq-your-convenient-mobile-patient-service-center",
    "title": "Meet LabQ: Your convenient mobile patient service center",
    "subtitle": "There’s more to getting tested than the prick of your arm or the swab of your cheek. There’s the speed of the appointment, cleanliness of",
    "cat": "News",
    "img": "woman-collecting-blood-samples-for-testing-on-diff-2022-12-16-06-56-53-utc-scaled-1.jpg",
    "imgSizing": "width",
    "date": "May 17, 2023",
    "content": "<p> There’s more to getting tested than the prick of your arm or the swab of your cheek. There’s the speed of the appointment, cleanliness of the facility, the bedside manner of the technician and the ease of accessing your results. Access all that and more, at one of our mobile patient service stations.</p><p> Whether it’s a standard health procedure or for work or travel, when you have a prescription for lab testing you don’t have time to waste finding a lab or waiting on results.</p><p> At LabQ, we understand that getting lab tests done can be a hassle, especially with New Yorkers’ busy schedules. That’s why we bring the lab to you with our state-of-the-art mobile lab testing unit. Our team of certified technicians is dedicated to providing you with fast, accurate results, all while ensuring your privacy and security. Our mobile lab testing unit can even come directly to your home or office, making it easy and convenient for you to get the testing you need without disrupting your day.</p><p> We accept most insurance plans, Medicare and Medicaid, so there’s no need to worry about any additional costs. At LabQ, we prioritize your health and wellbeing. That’s why we offer a wide range of lab tests, including blood work, STI testing, UTI testing, drug testing and more.</p><p> Our tests are processed efficiently and accurately in our automated system, so you can have peace of mind knowing your results will be available as soon as possible.</p><p> When you choose LabQ you can trust that you’re receiving high-quality lab testing services in a private and secure mobile unit. Our team is experienced in working with patients of all ages, from young children to seniors. We’re dedicated to providing you with the best possible experience, and we’re committed to helping you maintain your health and wellbeing.</p><p> Contact us today to schedule your appointment or walk right in with our accredited mobile lab testing unit to take the first step towards a healthier, happier you.</p>",
    "widgets": ["PatientReviews", "HowWeWork"]
  },
  {
    "id": "nearly-1k-covid-tests-offered-daily-at-morris-county-site",
    "title": "Nearly 1K COVID Tests Offered Daily At Morris County Site",
    "subtitle": "By Josh Bakan  |   Patch / MSN News RANDOLPH, NJ — More than 800 people received free COVID-19 tests on the first day of Morris",
    "cat": "In The News",
    "img": "AASFpsg.jpg",
    "imgSizing": "height",
    "date": "January 20, 2022",
    "content": "<div> <div> <div> <p> <strong >By <a target='_blank' rel='noopener' href='https://patch.com/users/josh-bakan-0' >Josh Bakan</a > | Patch / MSN News</strong > </p></div></div></div><div> <div> <div> <p> RANDOLPH, NJ — More than 800 people received free COVID-19 tests on the first day of Morris County’s reopened COVID-19 testing site. Officials believe the site, which opened Monday, will administer 800-900 tests daily for at least the coming week and beyond until the surge in COVID-19 cases weakens. </p><p> <img src='https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AASFpsg.img?w=747&h=560&m=6' alt='LabQ Diagnostics phlebotomist Tiara McClain administers a test Monday at the Morris County COVID-19 testing site.'/> <em> © Morris County photo LabQ Diagnostics phlebotomist Tiara McClain administers a test Monday at the Morris County COVID-19 testing site. </em> </p><div></div><p> “The center is running smoothly with everyone being tested rather quickly upon arrival,” said Tayfun Selen, director of the Morris County Board of Commissioners. </p><div> <p> Selen’s remarks came as he and other officials toured the facility, housed in the Student Center at the County College of Morris in Randolph. Phlebotomists with LabQ Diagnostics administered the tests, which involve LabQ PCR nasal swabs. </p><p> Patients were advised that the national demand for testing has inundated laboratories and delayed analysis. So results that would typically become available in 24 to 48 hours may take more than three days to obtain. </p><p> The center is open seven days per week from 7 a.m. to 6:45 p.m., except from 12:30-1 p.m. Testing is appointment-only, and they must be scheduled at Morris County’s <a tabindex='0' href='https://www.morriscountynj.gov/Residents/Health/Coronavirus/Get-a-Covid-19-Test' target='_blank' rel='noopener' > COVID-19 information webpage </a> . No one can walk into the facility without an appointment. </p><p> <img src='https://patch.com/img/cdn20/users/23182514/20220111/095627/styles/patch_image/public/scott-digiralomo-leads-jan-10-2022-tour-of-covid-19-testing-facility___11092143638.jpg' alt='https://patch.com/img/cdn20/users/23182514/20220111/095627/styles/patch_image/public/scott-digiralomo-leads-jan-10-2022-tour-of-covid-19-testing-facility___11092143638.jpg'/> <em> Scott DiGiralomo, right, led a tour Monday of the Morris County’s reopened testing facility. With him were Sheriff James Gannon, Commissioner Director Tayfun Selen and Commissioner John Krickus. Pictured behind Director Selen is Steve Ackerman. (Morris County photo) </em> </p><p> Morris County previously operated a testing center in the same location, but officials closed it in July as tests became more accessible and demand waned. The site’s reopening came as the state’s case totals continue to soar. </p></div><div> <p> The New Jersey Department of Health announced 21,691 — less than Sunday’s reported total of 26,615 cases and Saturday’s count of 29,564 infections, but well above any of the state’s pre-omicron-variant case numbers. </p><p> On a Friday conference call, representatives from local hospitals told county leadership and Morris County mayors that the center will help reduce emergency-room pressures brought on by people trying to get tested at hospitals. Atlantic Health System and Saint Clare’s Health also said most people needing hospitalization for COVID-19 never received the booster shot. </p><p> “Get your booster shot,” said County Commissioner John Krickus. “That was the clear message from the Atlantic Health System when we had an update call on Friday. Less than 5 percent of the COVID patients they are seeing have received their booster shot, and almost always the boosted patients have underlying conditions and often are elderly. Atlantic Health System indicated they have ICU capacity available, but booster shots are the key.” </p><p> Officials have seen a similar trend statewide. New Jersey has seen a higher percentage of infections among people who are fully vaccinated, as breakthrough infections represented 31,334 of New Jersey’s 101,000 cases from Dec. 20-26. But fully vaccinated individuals represented a far small portion of those hospitalized with COVID-19 (four of 2,640) and people who died from the virus (five of 146) in that span. </p><p> Only 43.5 percent of Morris County’s fully vaccinated population have received their booster dose, including only 47.5 percent of adults — the primary age group eligible for the booster — according to the Centers for Disease Control and Prevention. <a tabindex='0' href='https://www.cdc.gov/coronavirus/2019-ncov/vaccines/booster-shot.html' target='_blank' rel='nofollow noopener' > See info on booster eligibility </a> from the CDC. </p><p> Eleven people in Morris County have died from COVID-19 in the past week, according to the CDC. </p></div></div></div></div><div> <div> <div> <p> <a target='_blank' rel='noopener' href='https://patch.com/new-jersey/parsippany/nearly-1k-covid-tests-offered-daily-morris-county-site' > Source </a> </p></div></div></div>",
    "widgets": []
  },
  {
    "id": "nyc-elementary-school-pta-brings-in-covid-19-testing-van-to-supplement-school-tests",
    "title": "NYC elementary school PTA brings in COVID-19 testing van to supplement school tests",
    "subtitle": "By MICHAEL ELSEN-ROONEY   |  NEW YORK DAILY NEWS The idea for a mobile testing van came after parents at Public School 8 in Brooklyn Heights",
    "cat": "In The News",
    "img": "XDCSZRJXHFCYXKSEQJUR6AGATU.jpg",
    "imgSizing": "height",
    "date": "October 20, 2021",
    "content": "<section> <p> By <a href='https://www.nydailynews.com/michael-elsen-rooney-staff.html#nt=byline' > MICHAEL ELSEN-ROONEY </a> | NEW YORK DAILY NEWS </p></section><section> <p> The idea for a mobile testing van came after parents at Public School 8 in Brooklyn Heights expressed concerns that the city’s plan to swab 10% of unvaccinated kids who consent each week — was insufficient to catch new cases and give families peace of mind after potential exposures. The city’s program also leaves out vaccinated employees and kids in Kindergarten and pre-k. </p><p> “If only 10% are being selected every Monday, that’s a very small number of students getting tested on a regular basis,” said Jennifer Rendeiro, a P.S. 8 parent and co-president of the Parent Teacher Association. “One idea was to have this van, we would love to have it on a regular basis.” </p><figure> <img src='https://www.nydailynews.com/resizer/aJvAKDGvvQFnSLmDj-KhFYmcChE=/800x532/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/WKYYU4UC3CJN6CFVMAHCKMYGFI.jpg' alt='Public School 8, The Robert Fulton School in Brooklyn.'/> <figcaption> Public School 8, The Robert Fulton School in Brooklyn. (Joe Marino/New York Daily News) </figcaption> </figure> <p> The mobile testing van, operated by the company LabQ, will be outside the school between 7:30 and 8:30am Thursday for its first visit. If more than 50 people get tested, the visit will be free, but if fewer than 50 show up, the school’s PTA will be on the hook for $500, Rendeiro explained. </p><p> Rendeiro said that if the van draws enough interest, the PTA hopes to bring it back regularly, open access to the surrounding neighborhood and share the idea with other schools. </p><p> “My thought is if we can do this as a pilot and show it’s successful, maybe we can show how we did it with other surrounding schools,” said Rendeiro. </p><figure> <img src='https://www.nydailynews.com/resizer/Hw5yP63wGzN1EAWNupb03FsDSy0=/800x533/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/665LUIRVSVDA3BXQERS7ENMKDU.jpg' alt='A LabQ Diagnostics COVID-19 mobile testing van outside Grand Central Terminal in March 2021.'/> <figcaption> A LabQ Diagnostics COVID-19 mobile testing van outside Grand Central Terminal in March 2021. (Pacific Press/Pacific Press/LightRocket via Getty Images) </figcaption> </figure> <p> The mobile van experiment at P.S. 8 reflects concerns among some parents that the city’s random COVID-19 testing program <a href='https://www.nydailynews.com/new-york/education/ny-quarantine-teting-policy-changes-schools-20210920-pylvomjfnfelrngruezj44w4w4-story.html' target='_blank' rel='noreferrer noopener' > is too small. </a> </p><p> Last year, 20% of all students and staff in school buildings were tested each week. </p><p> <a href='https://ny.chalkbeat.org/2021/10/6/22713416/covid-testing-consent-nyc-school' target='_blank' rel='noreferrer noopener' > Fewer than 200,000 </a> , of the estimated unvaccinated 550,000 DOE students have returned consent forms to be tested for the virus in school. Some are unaware their consent forms from last year have expired </p><p> “If it’s not a real concerted effort to reach the parents, many don’t know,” said Cynthia McKnight, the Community Education Council president for District 13, where P.S. 8 is located. </p><figure> <img src='https://www.nydailynews.com/resizer/BBOr-WbDCuOMqPi8PIGdlbfABeU=/800x532/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/XDCSZRJXHFCYXKSEQJUR6AGATU.jpg' alt='COVID-19 testing outside Lincoln Center on Aug. 25, 2021.'/> <figcaption> COVID-19 testing outside Lincoln Center on Aug. 25, 2021. (NOAM GALAI/Pacific Press/LightRocket via Getty Images) </figcaption> </figure> <p> DOE spokesman Nathaniel Styer said “our schools have been among the safest places to be during the pandemic, and weekly in-school testing is critical to that success. The in-school positivity rate is significantly lower than citywide rates, 100% of our school employees are vaccinated, and we have many city-run, free testing sites across the city. </p><p> Rendeiro acknowledged that the mobile testing van arrangement was only possible because P.S. 8 has a PTA that can absorb the $500 cost. </p><p> The school raised <a href='https://ny.chalkbeat.org/2019/12/2/21113658/find-out-how-much-your-school-s-pta-raises-or-doesn-t' target='_blank' rel='noreferrer noopener' > more than $1.5 million during the 2018-19 school year </a> , according to city data, and it has a poverty rate of 12% — far below the DOE average of 73%. </p><figure> <img src='https://www.nydailynews.com/resizer/pzJuvqV5usx3qxLRRaIn7i__Wb8=/800x576/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/MAXZ4NRCYFFYTMWS67TK55ORWM.jpg' alt='A person gets a Covid test from a mobile LabQ van in August.'/> <figcaption> A person gets a Covid test from a mobile LabQ van in August. (NOAM GALAI/Pacific Press/LightRocket via Getty Images) </figcaption> </figure> <p> McKnight, who serves as a parent liaison for schools across the diverse District 13, said a middle school in the district with a higher poverty rate and a less-resourced PTA also expressed interest in beefing up its COVID-19 testing, but was struggling to figure out how. </p><p>“We do have equity issues in the district,” McKnight explaned.</p><p> Rendeiro said PTAs across the district have already begun working together to share ideas and resources, and she hopes to help spread the mobile testing van model more widely if it’s successful. </p><p> “The PTAs in District 13 run the gamut. It [equity] is obviously a concern,” Renediro said. “But it’s a concern about the testing too, and we’re trying to balance that and trying to keep our kids safe.” </p><p> <a href='https://www.nydailynews.com/new-york/education/ny-brooklyn-public-school-mobile-testing-van-20211020-4ax62k7tyrbfldqyzra7iny6im-story.html' target='_blank' rel='noopener' > SOURCE </a> </p></section>",
    "widgets": []
  },
  {
    "id": "labq-makes-headway-in-their-new-clinical-trial-departments",
    "title": "LabQ Makes Headway In Their New Clinical Trial Departments.",
    "subtitle": "LabQ Diagnostics, a rising star in the laboratory sector, launched a state-of-the-art clinical trial department. While this announcement comes to the delight of many, it",
    "cat": "News",
    "img": "LabQ-Research-1-1536x1022.jpg",
    "imgSizing": "height",
    "date": "July 15, 2021",
    "content": "<p> LabQ Diagnostics, a rising star in the laboratory sector, launched a state-of-the-art clinical trial department.</p><p> While this announcement comes to the delight of many, it comes as no surprise. Since its recent inception, LabQ has risen to the top at a record-breaking pace capturing the industry with speed, innovation, and accuracy.</p><p> Since the onset of Covid 19, LabQ has been working feverishly and has initiated the research of many Covid related research trials. They have designed a successful Covid antibody quantitative test which can be performed with a minute amount of capillary blood.</p><p> The research team is being led by a Columbian University research veteran with decades of experience conducting clinical trials. Dr. Chaudhry Subrata has an unprecedented track record of results within the studies he participated in.</p><p> “The greatest aspect of being part of the LabQ Diagnostics research team is the unlimited resources we have at our disposal in the form of tools, equipment, and the facility. There is nothing like conducting a study in your own facility. It adds so much value to the process and progress,” says R. Subrata.</p><p> The entire team is dedicated to one single cause: Bringing innovative medical advancements and solutions to the public with speed and precision. Dr. Martin King, the Medical Director of our research department stresses the team and client dedication that is present at LabQ.</p><p> “We would not have the ability to perform our studies and accomplish so much without the help and dedication of our team and our clients.”</p><p> The LabQ revolution is taking the industry by storm. It started when their doors were forced to open a year earlier than expected due to the onset of Covid 19. LabQ hasn’t looked back since. Within this short time frame, they have metamorphosed into the lab giants they’re currently known for surpassing their counterparts in their ability to process thousands of samples daily with accuracy and speed.</p><p> LabQ currently has over 100 mobile locations as well as multiple stand-alone facilities and is quickly expanding its network with new locations cropping up all over the United States. Their goal is to expand their reach without compromising on their renowned speed and accuracy.</p><p> While the announcement of this new department comes now, research progress is underway and is focused primarily on Covid 19 studies which include:</p><p> Covid 19 variant strains, Covid 19 sequencing, DBS Covid 19 antibody screening, and CT values related to active Covid 19 infection.</p><p> LabQ takes this opportunity to thank the clients that have been so dedicated to the cause.</p><p> “It’s all thanks to our loyal clients who show so much interest and extend so much help in aiding these clinical trials”, says Dr. Frank Hussain.</p><p> LabQ will stop at nothing. The uber rapid growth and innovation within such a short time period is indicative of what lies ahead.</p>",
    "widgets": []
  },
  {
    "id": "labq-ribbon-cutting-ceremony-for-newest-lab-and-data-hub-in-mt-olive",
    "title": "LabQ Ribbon Cutting Ceremony for newest lab and data hub in Mt. Olive.",
    "subtitle": "PRESS RELEASE Mt. Olive, NJ – On Wednesday, May 19th, HQ Health partnered with Robert Greenbaum, the mayor of Mt. Olive, to host an Open",
    "cat": "News",
    "img": "189195214_4165785780154267_6720674629117732980_n.jpg",
    "imgSizing": "width",
    "date": "May 24, 2021",
    "content": "<h5>PRESS RELEASE</h5><p> <strong>Mt. Olive, NJ -</strong> On Wednesday, May 19th, HQ Health partnered with Robert Greenbaum, the mayor of Mt. Olive, to host an Open House and Ribbon Cutting. The event was held for the new HQ Center at 100 International Dr., in the International Trade Center in Mt. Olive.</p><p> In addition to being the headquarters for HQ Health, this 100,000 square foot facility will hold LabQ Diagnostics’ state-of-the-art Molecular and Genetics Center which HQ Health will use to provide revolutionary personalized medicine. The center will also house the first of five national data centers. This location will also manage the other five. HQ Health is investing over $160 million in cutting edge cyber-security defense systems. This location will employ over 1,000 employees.</p><p> HQ is the new LabQ brand name for their suite of comprehensive and complete healthcare services, designed around the core mission to bring medicine to the highest level of personalization and convenience for each patient.</p><p> The HQ model incorporates each person’s molecular and genetic information, medical histories and regularly scheduled laboratory monitoring to tailor a life plan for the individual to optimize their health. This will be coupled with a holistic offering of telemedicine and telecounseling providers, several at-home services and community wellness and fitness centers, designed to optimize the member’s opportunities to better health.</p><p> ”Eighty-seven percent of the ability for a doctor to diagnose comes from lab results” said Moshe Landau, CEO of HQ Healthcare. “We want to treat the healthy not the sick. To do this we must learn who the patient is. With our acuity to testing and monitoring we can prevent and maintain your health rather than react in a time of crisis. The advancements in genomics provide invaluable insight into each individual patient. There is so much that the human body can tell us. We just have to listen. The lab forms the base for a complete ecosystem encompassing all the patient may need and then more. HQ aims to give you control of your health.”</p><p> “We are so excited to be here in Mt. Olive,” Landau continues. “Mt. Olive has been evaluated as one of the safest towns in the country. Also, we have very good access to the Connecticut to Pennsylvania corridor.”</p><p> HQ Health is very serious about data safety as well. “Quick and accurate results are important as they drive diagnosis and treatment. Any delay can impact patient outcomes,” Landau continues. “This is also why we are investing so heavily in cyber-protection and security. Last week’s hack of the Colonial Pipeline for a Bitcoin ransom shows us we must be ever vigilant to keep our systems foolproof and safe. The world is full of bad actors. There are thousands of cyber-attacks each day and we must maintain the highest of security levels. The data of our patients depends on it.”</p><p> “This becomes more important as we strive to offer increasingly personalized medicine. With having more data comes the responsibility to provide more and more protections.”</p><p> LabQ is further expanding their lab footprint, with additional laboratories opening soon in Pennsylvania, Florida, Chicago and Los Angeles. Future expansion is also being planned.</p><p> The data center in Mt. Olive is one of five data centers that HQ Health will have throughout the country. Each will be independent and completely identical to the others. Each of the centers will house the complete library of data for all patients, to provide redundancy, in case of any cyber-compromise. These data centers will all be managed from the Mt. Olive headquarters.</p><h6>About LabQ and HQ Healthcare</h6><p> LabQ was established in Brooklyn, NY in 2020 and quickly became the most innovative and advanced laboratory in the region, using technology and automation to expedite results. LabQ’s mission is to deliver quick results for doctors and local hospitals within the shortest period of time, thereby saving thousands of lives. This has established their reputation. This was especially important with Covid-19 testing over this past year as every minute mattered when it came to diagnosis, treatment and further exposures.</p><p> In addition to a full complement of core clinical testing, the Brooklyn lab has the capacity to run over 150,000 Covid-19 tests per 24 hours.</p>",
    "widgets": []
  },
  {
    "id": "laboratorio-movil-efectua-pruebas-de-covid-en-el-alto-manhattan",
    "title": "Laboratorio móvil efectúa pruebas de COVID en el Alto Manhattan",
    "subtitle": "BY JONATHAN INOA MANHATTAN PUBLISHED 3:00 PM ET JAN. 09, 2021 Hacerse una prueba del COVID-19 se toma alrededor de 5 minutos en un laboratorio",
    "cat": "News",
    "img": "20210620_200027-1.jpg",
    "imgSizing": "width",
    "date": "January 10, 2021",
    "content": "<h5>BY JONATHAN INOA MANHATTAN <br/></h5><h5>PUBLISHED 3:00 PM ET JAN. 09, 2021</h5><p> Hacerse una prueba del COVID-19 se toma alrededor de 5 minutos en un laboratorio móvil apostado en el Alto Manhattan.</p><p> Y una de las vecinas opinó al respecto: “Me fascinó ver el desempeño que están haciendo para la comunidad hispana. Principalmente que abundamos tantos en esta área, porque hay otros centros que están abarrotados y mucha gente se la quiere hacer y no quiere esperar”.</p><p> Se trata de uno de los centros móviles del laboratorio LabQ Diagnostic, contratados por el gobierno de la ciudad.</p><p> Esta unidad en particular, ofrece gratis pruebas del COVID y está ubicada sobre la calle 181, entre las avenidas Saint Nicholas y Audubon, en Washington Heights.</p><p> Wilton Rodríguez, es el encargado del centro móvil del Laboratorio LabQ Diagnostic: “Hay personas que no tienen seguro. Esto es gratis, solamente necesitan un ID<em></em>para comprobar su nombre, con eso es suficiente”.</p><p> Y tampoco importa el estatus migratorio. Hay cinco centros móviles como éste ubicados en lugares de alto contagio, cuatro en Manhattan y uno en Brooklyn.</p><p> Las pruebas colectadas aquí son enviadas a su laboratorio y los resultados dados a conocer de uno a dos días a través del teléfono o en persona.</p><p> “O nos puede dar su correo electrónico y ahí se lo mandamos”, explica Citlali Cerón, laboratorista de LabQ Diagnostic.</p><p> Según las cifras del gobierno municipal, el índice de contagios en el Alto Manhattan es de más de un 10%.</p><p> Eleazar Bueno, presidente de la Junta Comunitaria 12 de Washington Heights, acudió a hacerse la prueba y espera que otros sigan su ejemplo.</p><p> “Tenemos que sobreprotegerlos, y venir aquí hacerse ese examen periódicamente es una forma de hacerlo”, detalla Bueno.</p><p>El centro móvil permanecerá en este emplazamiento por varias semanas.</p><p> “Esto no ha acabado, esto continúa y va a continuar hasta que todos tomemos tomemos conciencia de que hay que cuidarse, hay que chequearse”, apunta Rodríguez.</p><p> Y si se quiere agilizar el proceso y no tener que hacer una fila al llegar, hay que registrarse y llenar la solicitud en línea, visitando la página web: <a href='https://labq.com/' target='_blank' rel='noopener'> labq.com </a></p><p> <a href='https://www.ny1noticias.com/nyc/noticias/noticias/2021/01/09/laboratorio-movil-efectua-pruebas-de-covid-en-el-alto-manhattan' target='_blank' rel='noopener' > SOURCE </a></p><div className='video-responsive'> <iframe width='885' height='664' src='https://www.youtube.com/embed/x6ofYbDj9CA' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen title='Laboratorio móvil efectúa pruebas de COVID en el Alto Manhattan - LabQ COVID tests Upper Manhattan'/></div>",
    "widgets": []
  }
]
