[
  {
    "id": "meet-labq-your-convenient-mobile-patient-service-center",
    "title": "Meet LabQ: Your convenient mobile patient service center",
    "subtitle": "There’s more to getting tested than the prick of your arm or the swab of your cheek. There’s the speed of the appointment, cleanliness of",
    "cat": "News",
    "img": "woman-collecting-blood-samples-for-testing-on-diff-2022-12-16-06-56-53-utc-scaled-1.jpg",
    "imgSizing": "width",
    "date": "May 17, 2023",
    "content": "<p> There’s more to getting tested than the prick of your arm or the swab of your cheek. There’s the speed of the appointment, cleanliness of the facility, the bedside manner of the technician and the ease of accessing your results. Access all that and more, at one of our mobile patient service stations.</p><p> Whether it’s a standard health procedure or for work or travel, when you have a prescription for lab testing you don’t have time to waste finding a lab or waiting on results.</p><p> At LabQ, we understand that getting lab tests done can be a hassle, especially with New Yorkers’ busy schedules. That’s why we bring the lab to you with our state-of-the-art mobile lab testing unit. Our team of certified technicians is dedicated to providing you with fast, accurate results, all while ensuring your privacy and security. Our mobile lab testing unit can even come directly to your home or office, making it easy and convenient for you to get the testing you need without disrupting your day.</p><p> We accept most insurance plans, Medicare and Medicaid, so there’s no need to worry about any additional costs. At LabQ, we prioritize your health and wellbeing. That’s why we offer a wide range of lab tests, including blood work, STI testing, UTI testing, drug testing and more.</p><p> Our tests are processed efficiently and accurately in our automated system, so you can have peace of mind knowing your results will be available as soon as possible.</p><p> When you choose LabQ you can trust that you’re receiving high-quality lab testing services in a private and secure mobile unit. Our team is experienced in working with patients of all ages, from young children to seniors. We’re dedicated to providing you with the best possible experience, and we’re committed to helping you maintain your health and wellbeing.</p><p> Contact us today to schedule your appointment or walk right in with our accredited mobile lab testing unit to take the first step towards a healthier, happier you.</p>",
    "widgets": ["PatientReviews", "HowWeWork"]
  }
]
